Revit 2026 API

# WallSweepType Enumeration

---

Represents the possible types for methods affecting wall sweeps or reveals.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum WallSweepType
```
```vb
Public Enumeration WallSweepType
```
```cpp
public enum class WallSweepType
```
```fsharp
type WallSweepType
```

| Member name | Value | Description |
| --- | --- | --- |
| Reveal | 1 | Represents a reveal. |
| Sweep | 0 | Represents a wall sweep. |

#### Reference

Autodesk.Revit.DB Namespace